Австралия/src/BusinessProcesses/Job/Job.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>Job</name>
  <basedOn>Catalog.Files</basedOn>
  <basedOn>Catalog.Users</basedOn>
  <basedOn>Task.PerformerTask</basedOn>
  <basedOn>Document.AccountSalesFromConsignee</basedOn>
  <basedOn>Document.AccountSalesToConsignor</basedOn>
  <basedOn>Document.AdditionalExpenses</basedOn>
  <basedOn>Document.ArApAdjustments</basedOn>
  <basedOn>Document.BankReconciliation</basedOn>
  <basedOn>Document.Budget</basedOn>
  <basedOn>Document.CashInflowForecast</basedOn>
  <basedOn>Document.CashReceipt</basedOn>
  <basedOn>Document.CashTransfer</basedOn>
  <basedOn>Document.CashTransferPlan</basedOn>
  <basedOn>Document.CashVoucher</basedOn>
  <basedOn>Document.CostAllocation</basedOn>
  <basedOn>Document.CreditNote</basedOn>
  <basedOn>Document.CustomsDeclaration</basedOn>
  <basedOn>Document.DebitNote</basedOn>
  <basedOn>Document.EmployeeTask</basedOn>
  <basedOn>Document.EmploymentContract</basedOn>
  <basedOn>Document.Event</basedOn>
  <basedOn>Document.ExpenditureRequest</basedOn>
  <basedOn>Document.ExpenseReport</basedOn>
  <basedOn>Document.FinancialReportInstance</basedOn>
  <basedOn>Document.FixedAssetDepreciationChanges</basedOn>
  <basedOn>Document.FixedAssetRecognition</basedOn>
  <basedOn>Document.FixedAssetSale</basedOn>
  <basedOn>Document.FixedAssetsDepreciation</basedOn>
  <basedOn>Document.FixedAssetUsage</basedOn>
  <basedOn>Document.FixedAssetWriteOff</basedOn>
  <basedOn>Document.ForeignCurrencyExchange</basedOn>
  <basedOn>Document.GoodsIssue</basedOn>
  <basedOn>Document.GoodsReceipt</basedOn>
  <basedOn>Document.IntraWarehouseTransfer</basedOn>
  <basedOn>Document.InventoryIncrease</basedOn>
  <basedOn>Document.InventoryReservation</basedOn>
  <basedOn>Document.InventoryTransfer</basedOn>
  <basedOn>Document.InventoryWriteOff</basedOn>
  <basedOn>Document.JobSheet</basedOn>
  <basedOn>Document.LetterOfAuthority</basedOn>
  <basedOn>Document.LoanContract</basedOn>
  <basedOn>Document.LoanInterestCommissionAccruals</basedOn>
  <basedOn>Document.Manufacturing</basedOn>
  <basedOn>Document.MonthEndClosing</basedOn>
  <basedOn>Document.OpeningBalanceEntry</basedOn>
  <basedOn>Document.Operation</basedOn>
  <basedOn>Document.OtherExpenses</basedOn>
  <basedOn>Document.PackingSlip</basedOn>
  <basedOn>Document.PaymentExpense</basedOn>
  <basedOn>Document.PaymentReceipt</basedOn>
  <basedOn>Document.Payroll</basedOn>
  <basedOn>Document.PayrollSheet</basedOn>
  <basedOn>Document.Pricing</basedOn>
  <basedOn>Document.Production</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.ProductReturn</basedOn>
  <basedOn>Document.PurchaseOrder</basedOn>
  <basedOn>Document.Quote</basedOn>
  <basedOn>Document.ReconciliationStatement</basedOn>
  <basedOn>Document.RequestForQuotation</basedOn>
  <basedOn>Document.RetailRevaluation</basedOn>
  <basedOn>Document.RMARequest</basedOn>
  <basedOn>Document.SalesInvoice</basedOn>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.SalesSlip</basedOn>
  <basedOn>Document.SalesTarget</basedOn>
  <basedOn>Document.ShiftClosure</basedOn>
  <basedOn>Document.Stocktaking</basedOn>
  <basedOn>Document.SupplierInvoice</basedOn>
  <basedOn>Document.SupplierQuote</basedOn>
  <basedOn>Document.TaxAccrual</basedOn>
  <basedOn>Document.TaxInvoiceIssued</basedOn>
  <basedOn>Document.TaxInvoiceReceived</basedOn>
  <basedOn>Document.TerminationOfEmployment</basedOn>
  <basedOn>Document.Timesheet</basedOn>
  <basedOn>Document.TransferAndPromotion</basedOn>
  <basedOn>Document.TransferOrder</basedOn>
  <basedOn>Document.Transformation</basedOn>
  <basedOn>Document.WeeklyTimesheet</basedOn>
  <basedOn>Document.WorkOrder</basedOn>
  <basedOn>Document.RegistersCorrection</basedOn>
  <basedOn>Catalog.Counterparties</basedOn>
  <basedOn>Catalog.Products</basedOn>
  <basedOn>Catalog.CounterpartyContracts</basedOn>
  <basedOn>Document.ManufacturingOperation</basedOn>
  <basedOn>Document.VATInvoiceForICT</basedOn>
  <basedOn>Document.ManufacturingOverheadsRates</basedOn>
  <basedOn>Document.RequisitionOrder</basedOn>
  <basedOn>Document.ProductionTask</basedOn>
  <basedOn>Document.SubcontractorOrderIssued</basedOn>
  <basedOn>Document.SubcontractorInvoiceReceived</basedOn>
  <basedOn>Document.KitOrder</basedOn>
  <basedOn>Document.ActualSalesVolume</basedOn>
  <basedOn>Document.DirectDebit</basedOn>
  <basedOn>Document.OnlineReceipt</basedOn>
  <basedOn>Document.OnlinePayment</basedOn>
  <task>Task.PerformerTask</task>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <comment>Importance of tasks at action point Complete for assignee.</comment>
    <type>
      <types>EnumRef.TaskImportanceOptions</types>
    </type>
  </attributes>
  <attributes>
    <name>JobCompleted</name>
    <comment>Job execution result after the business process is completed.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MainTask</name>
    <type>
      <types>TaskRef.PerformerTask</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletedOn</name>
    <comment>Actual business process completion date.</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.PerformerRoles</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <comment>Job details</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OnValidation</name>
    <comment>This flag indicating that task supervisor is specified.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IterationNumber</name>
    <comment>Number of business process cycles between assignee and supervisor.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Confirmed</name>
    <comment>Internal business process state.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Topic</name>
    <comment>System object for which the business process was created.</comment>
    <type>
      <types>DefinedType.TaskSubject</types>
    </type>
  </attributes>
  <attributes>
    <name>Supervisor</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.PerformerRoles</types>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionResult</name>
    <comment>Correspondence history between assignee and supervisor</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>State</name>
    <type>
      <types>EnumRef.BusinessProcessStates</types>
    </type>
  </attributes>
  <attributes>
    <name>DueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>VerificationDueDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AuthorString</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExternalJob</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTask</name>
    <type>
      <types>TaskRef.PerformerTask</types>
    </type>
  </attributes>
  <attributes>
    <name>SubjectContent</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>MainAddressingObjectSupervisor</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalAddressingObjectSupervisor</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaskPerformersGroupSupervisor</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Австралия/src/InformationRegisters/TaskPerformers/TaskPerformers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TaskPerformers</name>
  <attributes>
    <name>TaskPerformersGroup</name>
    <type>
      <types>CatalogRef.TaskPerformersGroups</types>
    </type>
  </attributes>
  <dimensions>
    <name>PerformerRole</name>
    <type>
      <types>CatalogRef.PerformerRoles</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Performer</name>
    <type>
      <types>CatalogRef.ExternalUsers</types>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>MainAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AdditionalAddressingObject</name>
    <type>
      <types>Characteristic.TaskAddressingObjects</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/BusinessProcesses/Job/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

#Region ForCallsFromOtherSubsystems

// StandardSubsystems.BatchObjectsModification

// Returns object attributes allowed to be edited using batch attribute change data processor.
// 
//
// Returns:
//  Array - a list of object attribute names.
Function AttributesToEditInBatchProcessing() Export
	
	Result = New Array;
	Result.Add("Author");
	Result.Add("Importance");
	Result.Add("Performer");
	Result.Add("CheckExecution");
	Result.Add("Supervisor");
	Result.Add("DueDate");
	Result.Add("VerificationDueDate");
	Return Result;
	
EndFunction

// End StandardSubsystems.BatchObjectsModification

// StandardSubsystems.BusinessProcessesAndTasks

// Gets a structure with description of a task execution form.
// The function is called when opening the task execution form.
//
// Parameters:
//   TaskRef                - TaskRef.PerformerTask - a task.
//   BusinessProcessRoutePoint - BusinessProcessRoutePointRef - a route point.
//
// Returns:
//   Structure   - a structure with description of the task execution form.
//                 Key FormName contains the form name that is passed to the OpenForm() context method.
//                 Key FormOptions contains the form parameters.
//
Function TaskExecutionForm(TaskRef, BusinessProcessRoutePoint) Export
	
	Result = New Structure;
	Result.Insert("FormParameters", New Structure("Key", TaskRef));
	Result.Insert("FormName", "BusinessProcess.Job.Form.Action" + BusinessProcessRoutePoint.Name);
	Return Result;
	
EndFunction

// The function is called when forwarding a task.
//
// Parameters:
//   TaskRef  - TaskRef.PerformerTask - a forwarded task.
//   NewTaskRef  - TaskRef.PerformerTask - a task for a new assignee.
//
Procedure OnForwardTask(TaskRef, NewTaskRef) Export
	
	// ACC:1327-off The business process lock is set earlier in the BusinessProcessesAndTasksServerCall.
	// ForwardTasks calling function.
	BusinessProcessObject = TaskRef.BusinessProcess.GetObject();
	LockDataForEdit(BusinessProcessObject.Ref);
	BusinessProcessObject.ExecutionResult = ExecutionResultOnForward(TaskRef) 
		+ BusinessProcessObject.ExecutionResult;
	SetPrivilegedMode(True);
	BusinessProcessObject.Write();
	// ACC:1327-on
	
EndProcedure

// The function is called when a task is executed from a list form.
//
// Parameters:
//   TaskRef  - TaskRef.PerformerTask - a task.
//   BusinessProcessRef - BusinessProcessRef - a business process for which the TaskRef task is generated.
//   BusinessProcessRoutePoint - BusinessProcessRoutePointRef - a route point.
//
Procedure DefaultCompletionHandler(TaskRef, BusinessProcessRef, BusinessProcessRoutePoint) Export
	
	IsRoutePointComplete = (BusinessProcessRoutePoint = BusinessProcesses.Job.RoutePoints.Execute);
	IsRoutePointCheck = (BusinessProcessRoutePoint = BusinessProcesses.Job.RoutePoints.Check);
	If Not IsRoutePointComplete AND Not IsRoutePointCheck Then
		Return;
	EndIf;
	
	// Setting default values for batch task execution.
	BeginTransaction();
	Try
		BusinessProcessesAndTasksServer.LockBusinessProcesses(BusinessProcessRef);
		
		SetPrivilegedMode(True);
		JobObject = BusinessProcessRef.GetObject();
		LockDataForEdit(JobObject.Ref);
		
		If IsRoutePointComplete Then
			JobObject.JobCompleted = True;	
		ElsIf IsRoutePointCheck Then
			JobObject.JobCompleted = True;
			JobObject.Confirmed = True;
		EndIf;
		JobObject.Write(); // ACC:1327 The lock is set in the BusinessProcessesAndTasksServer.LockBusinessProcesses.
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;	
	
EndProcedure	

// End StandardSubsystems.BusinessProcessesAndTasks

// StandardSubsystems.AccessManagement

// See AccessManagementOverridable.OnFillListsWithAccessRestriction. 
Procedure OnFillAccessRestriction(Restriction) Export
	
	Restriction.Text =
	"AttachAdditionalTables
	|ThisList AS Job
	|
	|LEFT JOIN InformationRegister.TaskPerformers AS TaskPerformers
	|ON
	|	TaskPerformers.PerformerRole = Job.Performer
	|	AND TaskPerformers.MainAddressingObject = Job.MainAddressingObject
	|	AND TaskPerformers.AdditionalAddressingObject = Job.AdditionalAddressingObject
	|
	|LEFT JOIN InformationRegister.TaskPerformers AS TaskSupervisors
	|ON
	|	TaskSupervisors.PerformerRole = Job.Supervisor
	|	AND TaskSupervisors.MainAddressingObject = Job.MainAddressingObjectSupervisor
	|	AND TaskSupervisors.AdditionalAddressingObject = Job.AdditionalAddressingObjectSupervisor
	|;
	|AllowRead
	|WHERE
	|	ValueAllowed(Author)
	|	OR ValueAllowed(Performer EXCEPT Catalog.PerformerRoles)
	|	OR ValueAllowed(TaskPerformers.Performer)
	|	OR ValueAllowed(Supervisor EXCEPT Catalog.PerformerRoles)
	|	OR ValueAllowed(TaskSupervisors.Performer)
	|;
	|AllowUpdateIfReadingAllowed
	|WHERE
	|	ValueAllowed(Author)";
	
EndProcedure

// End StandardSubsystems.AccessManagement

// StandardSubsystems.AttachableCommands

// Defined the list of commands for creating on the basis.
//
// Parameters:
//  GenerationCommands - ValueTable - see GenerationOverridable.BeforeAddGenerationCommands. 
//  Parameters - Structure - see GenerationOverridable.BeforeAddGenerationCommands. 
//
Procedure AddGenerationCommands(GenerationCommands, Parameters) Export
	
EndProcedure

// Use this procedure in the AddGenerationCommands procedure of other object manager modules.
// Adds this object to the list of object generation commands.
//
// Parameters:
//  GenerationCommands - ValueTable - see GenerationOverridable.BeforeAddGenerationCommands. 
//
// Returns:
//  ValueTableRow, Undefined - details of the added command.
//
Function AddGenerateCommand(GenerationCommands) Export
	
	If Common.SubsystemExists("StandardSubsystems.AttachableCommands") Then
		ModuleGeneration = Common.CommonModule("Generate");
		Return ModuleGeneration.AddGenerationCommand(GenerationCommands, Metadata.BusinessProcesses.Job);
	EndIf;
	
	Return Undefined;
	
EndFunction

// End StandardSubsystems.AttachableCommands

#EndRegion

#EndRegion

#EndIf

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

////////////////////////////////////////////////////////////////////////////////
// Other

// Sets the state of the task form items.
Procedure SetTaskFormItemsState(Form) Export
	
	If Form.Items.Find("ExecutionResult") <> Undefined 
		AND Form.Items.Find("ExecutionHistory") <> Undefined Then
			Form.Items.ExecutionHistory.Picture = CommonClientServer.CommentPicture(Form.JobExecutionResult);
	EndIf;
	
	Form.Items.Topic.Hyperlink = Form.Object.Topic <> Undefined AND NOT Form.Object.Topic.IsEmpty();
	Form.SubjectString = Common.SubjectString(Form.Object.Topic);	
	
EndProcedure

Function ExecutionResultOnForward(Val TaskRef)
	
	StringFormat = "%1, %2 " + NStr("ru = 'перенаправил(а) задачу'; en = 'redirected the task'; pl = 'przekierowano zadanie';es_ES = 'redirigir la tarea';es_CO = 'redirigir la tarea';tr = 'görev yeniden yönlendirildi';it = 'incarico reindirizzato';de = 'die Aufgabe weitergeleitet'") + ":
		|%3
		|";
	
	Comment = TrimAll(TaskRef.ExecutionResult);
	Comment = ?(IsBlankString(Comment), "", Comment + Chars.LF);
	Result = StringFunctionsClientServer.SubstituteParametersToString(StringFormat, TaskRef.CompletionDate, TaskRef.Performer, Comment);
	Return Result;

EndFunction

#EndRegion

#EndIf
